package src.main.java.prepay.task342;

/**
 * Создайте метод public static void printHelloWorld(), который будет выводить в консоль строку “Hello world!”.
 *
 * Требования:
 * 1. Метод должен иметь модификатор static
 * 2. Метод не должен принимать параметры
 * 3. Метод должен выводить в консоль строку “Hello world!”
 * 4. Метод не должен ничего возвращать
 */
public class Task342 {
    public static void main(String[] args) {
        printHelloWorld();
    }
    public static void printHelloWorld() {
        String e = "Hello world!";
        System.out.println(e);
    }
}
