package src.main.java.prepay.task400;

/**
 * Реализовать игру, определяющая загаданное игроком целое число.
 * При запуске игры вводится диапозон, в котором лежит загаданное число.
 * Далее игра выводит число, спрашивая, верное ли оно, либо загаданное больше/меньше выведенного.
 * Когда игра число угадает, она должна вывести в консоль за какое количество попыток число было угадано.
 * Программа должна быть написано так, чтобы свести количество попыток к минимуму.
 * Пример вывода в консоль:
 Старт игры
 Введите нижний предел
 >10
 Введите верхний предел
 >50
 Загаданное число - 19? (Верно/Меньше/Больше)
 >Больше
 Загаданное число - 29? (Верно/Меньше/Больше)
 >Верно
 Загаданное число 29. Определено за 2 попытки
 Конец игры
 */
public class Game1 {
    public static void main(String[] args) {
    }
}