package src.main.java.prepay.task400;

/**
 * Реализовать игру, предлагающая игроку угадать загаданное ей число.
 * При запуске игры игроком вводится диапозон, в котором будет лежать загадываемое число.
 * Далее игра дает возможность игроку ввести число, после каждой попытки сообщая, загаданное больше или меньше введенного.
 * Когда игра число угадает, она должна вывести в консоль за какое количество попыток число было угадано.
 * Пример вывода в консоль:
 Старт игры
 Введите нижний предел
 >0
 Введите верхний предел
 >100
 Число загадано
 Введите число
 >50
 Неверно. Загаданное число больше. Введите новое число
 >70
 Неверно. Загаданное число меньше. Введите новое число
 >60
 Верно. Загаданное число определено за 2 попытки
 Конец игры
 */
public class Game2 {
    public static void main(String[] args) {
    }
}